// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]


int DataEntry(string str)
{
    Console.Write(str);
    int number  = int.Parse(Console.ReadLine());
    return number;
}